cask_args appdir: '/Applications'

# taps
tap 'beeftornado/rmtree' || true
tap 'buo/cask-upgrade' || true
tap 'github/gh' || true
tap 'homebrew/bundle' || true
tap 'homebrew/cask' || true
tap 'homebrew/cask-drivers' || true
tap 'homebrew/cask-fonts' || true
tap 'homebrew/cask-versions' || true
tap 'homebrew/core' || true

# fonts
cask 'font-hack'

# version control
brew 'gist'
brew 'git'
brew 'hub'
brew 'gh'

# languages
brew 'go'
brew 'node'
brew 'python'
brew 'ruby-build'
brew 'rbenv'
brew 'rust'

# utilities
brew 'autojump'
brew 'autoconf'
brew 'automake'
brew 'awk'
brew 'bash'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'dive'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'openssl'
brew 'jq'
brew 'krew'
brew 'kubectx'
brew 'kustomize'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'lsd'
brew 'markdown'
brew 'mysql'
brew 'nano'
brew 'nmap'
brew 'neovim'
brew 'octant'
brew 'protobuf'
brew 'ripgrep'
brew 'shellcheck'
brew 'skaffold'
brew 'stern'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'yamllint'
brew 'yq'
brew 'zlib'
brew 'zsh'
brew 'mas' # command line interface for mac app store
brew 'kind'
brew 'kube-ps1' # command line prompt to show context/ns for bash and zsh

# applications
cask 'appcleaner'
cask 'docker'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'ngrok'
cask 'rectangle'
cask 'tuple'
cask 'visual-studio-code'
cask 'bartender'
cask 'airbuddy'
cask 'alfred'
cask '1password'
cask 'fantastical'
cask 'brave-browser'
cask 'private-internet-access'
cask 'vlc'
cask 'zoom'
cask 'transmission'
